doodles_rest/app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Learn Python"], ["created_at", "2020-02-11 18:34:00.048261"], ["updated_at", "2020-02-11 18:34:00.048261"]]
---
  def create
    @category = Category.create!(category_params)

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "others updated"], ["updated_at", "2020-02-11 19:25:23.580470"], ["id", 6]]
---
  def update
    @category.update(category_params)