doodles_rest/app/controllers/doodles_controller.rb

  def index
    @category = Category.find(params[:category_id])
    @doodles = current_user.doodles
    json_response(@doodles.where(category_id: @category.id))
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "doodles".* FROM "doodles" WHERE "doodles"."category_id" = ? LIMIT ?  [["category_id", 1], ["LIMIT", 1]]

  def public_doodles
    @doodles = Doodle.all
---
SELECT "doodles".* FROM "doodles"

  def public_doodles_by_category
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @doodles = current_user.doodles
    @category = Category.find(params[:category_id])
    @doodles_cat = @doodles.where(category_id: @category.id)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "doodles".* FROM "doodles" WHERE "doodles"."category_id" = ? AND "doodles"."id" = ? LIMIT ?  [["category_id", 1], ["id", 1], ["LIMIT", 1]]

  def create
    @doodles = current_user.doodles
    @category = Category.find(params[:category_id])
    @doodle = @doodles.where(category_id: @category.id).create(doodle_params)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "doodles".* FROM "doodles" WHERE "doodles"."category_id" = ? AND "doodles"."id" = ? LIMIT ?  [["category_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "doodles" ("title", "path", "created_by", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @doodles = current_user.doodles
    @category = Category.find(params[:category_id])
    @doodles_cat = @doodles.where(category_id: @category.id)
    @doodle = @doodles_cat.find(params[:id]).update(doodle_params)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "doodles".* FROM "doodles" WHERE "doodles"."category_id" = ? AND "doodles"."id" IS NULL LIMIT ?  [["category_id", 1], ["LIMIT", 1]]
UPDATE "doodles" SET "title" = ?, "updated_at" = ? WHERE "doodles"."id" = ?  [["title", "house updated"], ["updated_at", "2020-02-19 22:13:46.028507"], ["id", 3]]

  def destroy
    @doodles = current_user.doodles
    @category = Category.find(params[:category_id])
    @doodles_cat = @doodles.where(category_id: @category.id)
    @doodle = @doodles_cat.find(params[:id])
    @doodle.delete
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "doodles".* FROM "doodles" WHERE "doodles"."category_id" = ? AND "doodles"."id" = ? LIMIT ?  [["category_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "doodles" WHERE "doodles"."id" = ?  [["id", 1]]