doodles_rest/app/controllers/doodles_controller.rb

INSERT INTO "doodles" ("title", "path", "created_by", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test3"], ["path", "sample path3"], ["created_by", "1"], ["category_id", 1], ["created_at", "2020-02-13 19:41:42.450297"], ["updated_at", "2020-02-13 19:41:42.450297"]]
---
  def create
    @category = current_user.doodles.create!(doodle_params)

UPDATE "doodles" SET "path" = ?, "updated_at" = ? WHERE "doodles"."id" = ?  [["path", "sample path3 updated"], ["updated_at", "2020-02-13 19:42:16.849598"], ["id", 9]]
---
  def update
    @doodle.update(doodle_params)

DELETE FROM "doodles" WHERE "doodles"."id" = ?  [["id", 5]]
---
  def destroy
    @doodle.destroy

SELECT "doodles".* FROM "doodles" WHERE "doodles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_category_doodle
    if @category
      @doodle = @category.doodles.find_by!(id: params[:id])